IDENTIFICATION DIVISION.
PROGRAM-ID. CALCINTEREST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-RESULT       PIC 9(9)V99.

LINKAGE SECTION.
01 LK-PRINCIPAL    PIC 9(7)V99.
01 LK-RATE         PIC 9(3)V9999.
01 LK-YEARS        PIC 9(2).
01 LK-RESULT       PIC 9(9)V99.

PROCEDURE DIVISION USING LK-PRINCIPAL LK-RATE
                         LK-YEARS LK-RESULT.
    COMPUTE WS-RESULT = LK-PRINCIPAL *
                        (1 + LK-RATE / 100) ** LK-YEARS
    MOVE WS-RESULT TO LK-RESULT
    EXIT PROGRAM.
    